site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** Prime Numbers
:PROPERTIES:
:EXPORT_FILE_NAME: prime-numbers
:EXPORT_DATE: 2023-03-01
:ID:       d621ddd6-0b6d-4175-b474-314799ed46ae
:END:

Prime numbers are a familiar feature in mathematics, and often come up in competitive programming.  In this lecture
we will derive the Sieve of Erastosthenes, show how to factor large numbers, and discuss the practical limits to the
number of prime numbers we can generate during a contest.

*** Slides

- [[/slides/prime-numbers.pdf][Prime Numbers]]

