content/lectures/prime-numbers.md
+++
title = "Prime Numbers"
author = ["Mattox Beckman"]
date = 2023-03-01
draft = false
+++

Prime numbers are a familiar feature in mathematics, and often come up in competitive programming.  In this lecture
we will derive the Sieve of Erastosthenes, show how to factor large numbers, and discuss the practical limits to the
number of prime numbers we can generate during a contest.


## Slides {#slides}

-   [Prime Numbers](/slides/prime-numbers.pdf)
